In [1]:
import pandas as pd

In [12]:
Data = {
    'FirstName' : ['Aryan','Rohan','Riya','Yash','Siddhant'],
    'LastName' : ['Singh','Agrawal','Shah','Bhatia','Khanna'],
    'Type' : ['Full-time Employee','Intern','Full-time Employee','Part-time Employee','Full-time Employee'],
    'Department' : ['Adminstration','Technical','Adminstration','Technical','Management'],
    'YoE' : [2,3,5,7,6],
    'Salary' : [20000,5000,10000,10000,20000]
    
}
employee_df = pd.DataFrame(Data)
print(df)

  FirstName LastName                Type     Department  YoE  Salary
0     Aryan    Singh  Full-time Employee  Adminstration    2   20000
1     Rohan  Agrawal              Intern      Technical    3    5000
2      Riya     Shah  Full-time Employee  Adminstration    5   10000
3      Yash   Bhatia  Part-time Employee      Technical    7   10000
4  Siddhant   Khanna  Full-time Employee     Management    6   20000

In [13]:
table = pd.pivot_table(employee_df,index = ['Type','Department'],values = 'Salary',aggfunc = 'mean')
table

                                  Salary
Type               Department
Full-time Employee Adminstration   15000
                   Management      20000
Intern             Technical        5000
Part-time Employee Technical       10000

In [15]:
pivot = pd.pivot_table(
data = employee_df,
index = 'Type',
values = 'Salary',
aggfunc = ['mean','sum']
)
print(pivot)

                            mean    sum
                          Salary Salary
Type
Full-time Employee  16666.666667  50000
Intern               5000.000000   5000
Part-time Employee  10000.000000  10000

In [16]:
employee_df.pivot_table(index = 'Type',values = 'Salary',aggfunc = 'count')

                    Salary
Type
Full-time Employee       3
Intern                   1
Part-time Employee       1